# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_library_set -name max -timing {/cadence/kits/TOWER/ts18is/std_cells_TOWER_Cds6_Iphc/SRC/Std_cells/FS120_STD_Cells_0_18um_2005_12/DW_TOWER_tsl18fs120/2005.12/synopsys/2004.12/models/tsl18fs120_max.lib}
create_constraint_mode -name default -sdc_files {output/r2g.sdc}
create_delay_corner -name dc_max -early_library_set {max}
create_analysis_view -name max -constraint_mode {default} -delay_corner {dc_max}
